## Plan Result (ithc-global)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"
        name                                         = "hmcts-ithc"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-civil-citizen-ui" -> "healthProbeSettings-hmcts-access"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/civil-citizen-ui"
          ~ load_balancing_name = "loadBalancingSettings-civil-citizen-ui" -> "loadBalancingSettings-hmcts-access"
          ~ name                = "civil-citizen-ui" -> "hmcts-access"

          ~ backend {
              ~ host_header = "civil-citizen-ui.ithc.platform.hmcts.net" -> "hmcts-access.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc" -> "healthProbeSettings-civil-citizen-ui"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/cmc"
          ~ load_balancing_name = "loadBalancingSettings-cmc" -> "loadBalancingSettings-civil-citizen-ui"
          ~ name                = "cmc" -> "civil-citizen-ui"

          ~ backend {
              ~ host_header = "moneyclaims.ithc.platform.hmcts.net" -> "civil-citizen-ui.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc-legal" -> "healthProbeSettings-cmc"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/cmc-legal"
          ~ load_balancing_name = "loadBalancingSettings-cmc-legal" -> "loadBalancingSettings-cmc"
          ~ name                = "cmc-legal" -> "cmc"

          ~ backend {
              ~ host_header = "moneyclaims-legal.ithc.platform.hmcts.net" -> "moneyclaims.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact" -> "healthProbeSettings-cmc-legal"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/fact"
          ~ load_balancing_name = "loadBalancingSettings-fact" -> "loadBalancingSettings-cmc-legal"
          ~ name                = "fact" -> "cmc-legal"

          ~ backend {
              ~ host_header = "fact.ithc.platform.hmcts.net" -> "moneyclaims-legal.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact-admin" -> "healthProbeSettings-fact"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/fact-admin"
          ~ load_balancing_name = "loadBalancingSettings-fact-admin" -> "loadBalancingSettings-fact"
          ~ name                = "fact-admin" -> "fact"

          ~ backend {
              ~ host_header = "fact-admin.ithc.platform.hmcts.net" -> "fact.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-rpts" -> "healthProbeSettings-fact-admin"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/rpts"
          ~ load_balancing_name = "loadBalancingSettings-rpts" -> "loadBalancingSettings-fact-admin"
          ~ name                = "rpts" -> "fact-admin"

          ~ backend {
              ~ host_header = "rpts.ithc.platform.hmcts.net" -> "fact-admin.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-nfdiv" -> "healthProbeSettings-rpts"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/nfdiv"
          ~ load_balancing_name = "loadBalancingSettings-nfdiv" -> "loadBalancingSettings-rpts"
          ~ name                = "nfdiv" -> "rpts"

          ~ backend {
              ~ host_header = "nfdiv.ithc.platform.hmcts.net" -> "rpts.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-nfdiv"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd" -> "loadBalancingSettings-nfdiv"
          ~ name                = "gateway-ccd" -> "nfdiv"

          ~ backend {
              ~ host_header = "gateway-ccd.ithc.platform.hmcts.net" -> "nfdiv.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-return-case-doc-ccd" -> "healthProbeSettings-gateway-ccd"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/return-case-doc-ccd"
          ~ load_balancing_name = "loadBalancingSettings-return-case-doc-ccd" -> "loadBalancingSettings-gateway-ccd"
          ~ name                = "return-case-doc-ccd" -> "gateway-ccd"

          ~ backend {
              ~ host_header = "return-case-doc-ccd.ithc.platform.hmcts.net" -> "gateway-ccd.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-return-case-doc-ccd"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-return-case-doc-ccd"
          ~ name                = "xui-approve-org" -> "return-case-doc-ccd"

          ~ backend {
              ~ host_header = "administer-orgs.ithc.platform.hmcts.net" -> "return-case-doc-ccd.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "xui-manage-org" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "manage-org.ithc.platform.hmcts.net" -> "administer-orgs.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "xui-register-org" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "register-org.ithc.platform.hmcts.net" -> "manage-org.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "xui-webapp" -> "xui-register-org"

          ~ backend {
              ~ host_header = "manage-case.ithc.platform.hmcts.net" -> "register-org.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ia-aip" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/ia-aip"
          ~ load_balancing_name = "loadBalancingSettings-ia-aip" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "ia-aip" -> "xui-webapp"

          ~ backend {
              ~ host_header = "immigration-appeal.ithc.platform.hmcts.net" -> "manage-case.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-probate" -> "healthProbeSettings-ia-aip"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/probate"
          ~ load_balancing_name = "loadBalancingSettings-probate" -> "loadBalancingSettings-ia-aip"
          ~ name                = "probate" -> "ia-aip"

          ~ backend {
              ~ host_header = "probate.ithc.platform.hmcts.net" -> "immigration-appeal.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq" -> "healthProbeSettings-probate"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/pcq"
          ~ load_balancing_name = "loadBalancingSettings-pcq" -> "loadBalancingSettings-probate"
          ~ name                = "pcq" -> "probate"

          ~ backend {
              ~ host_header = "pcq.ithc.platform.hmcts.net" -> "probate.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau" -> "healthProbeSettings-pcq"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/lau"
          ~ load_balancing_name = "loadBalancingSettings-lau" -> "loadBalancingSettings-pcq"
          ~ name                = "lau" -> "pcq"

          ~ backend {
              ~ host_header = "lau.ithc.platform.hmcts.net" -> "pcq.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paybubble" -> "healthProbeSettings-lau"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/paybubble"
          ~ load_balancing_name = "loadBalancingSettings-paybubble" -> "loadBalancingSettings-lau"
          ~ name                = "paybubble" -> "lau"

          ~ backend {
              ~ host_header = "paybubble.ithc.platform.hmcts.net" -> "lau.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-bar" -> "healthProbeSettings-paybubble"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/bar"
          ~ load_balancing_name = "loadBalancingSettings-bar" -> "loadBalancingSettings-paybubble"
          ~ name                = "bar" -> "paybubble"

          ~ backend {
              ~ host_header = "bar.ithc.platform.hmcts.net" -> "paybubble.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fees-register" -> "healthProbeSettings-bar"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/fees-register"
          ~ load_balancing_name = "loadBalancingSettings-fees-register" -> "loadBalancingSettings-bar"
          ~ name                = "fees-register" -> "bar"

          ~ backend {
              ~ host_header = "fees-register.ithc.platform.hmcts.net" -> "bar.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-admin" -> "healthProbeSettings-fees-register"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/idam-web-admin"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-admin" -> "loadBalancingSettings-fees-register"
          ~ name                = "idam-web-admin" -> "fees-register"

          ~ backend {
              ~ host_header = "idam-web-admin.ithc.platform.hmcts.net" -> "fees-register.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-user-dashboard" -> "healthProbeSettings-idam-web-admin"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/idam-user-dashboard"
          ~ load_balancing_name = "loadBalancingSettings-idam-user-dashboard" -> "loadBalancingSettings-idam-web-admin"
          ~ name                = "idam-user-dashboard" -> "idam-web-admin"

          ~ backend {
              ~ host_header = "idam-user-dashboard.ithc.platform.hmcts.net" -> "idam-web-admin.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tribunals" -> "healthProbeSettings-idam-user-dashboard"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/sscs-tribunals"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tribunals" -> "loadBalancingSettings-idam-user-dashboard"
          ~ name                = "sscs-tribunals" -> "idam-user-dashboard"

          ~ backend {
              ~ host_header = "benefit-appeal.ithc.platform.hmcts.net" -> "idam-user-dashboard.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-cor" -> "healthProbeSettings-sscs-tribunals"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/sscs-cor"
          ~ load_balancing_name = "loadBalancingSettings-sscs-cor" -> "loadBalancingSettings-sscs-tribunals"
          ~ name                = "sscs-cor" -> "sscs-tribunals"

          ~ backend {
              ~ host_header = "sscs-cor.ithc.platform.hmcts.net" -> "benefit-appeal.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-adoption-web" -> "healthProbeSettings-sscs-cor"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/adoption-web"
          ~ load_balancing_name = "loadBalancingSettings-adoption-web" -> "loadBalancingSettings-sscs-cor"
          ~ name                = "adoption-web" -> "sscs-cor"

          ~ backend {
              ~ host_header = "adoption-web.ithc.platform.hmcts.net" -> "sscs-cor.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-privatelaw" -> "healthProbeSettings-adoption-web"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/privatelaw"
          ~ load_balancing_name = "loadBalancingSettings-privatelaw" -> "loadBalancingSettings-adoption-web"
          ~ name                = "privatelaw" -> "adoption-web"

          ~ backend {
              ~ host_header = "privatelaw.ithc.platform.hmcts.net" -> "adoption-web.ithc.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hmi-apim" -> "healthProbeSettings-privatelaw"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/hmi-apim"
          ~ load_balancing_name = "loadBalancingSettings-hmi-apim" -> "loadBalancingSettings-privatelaw"
          ~ name                = "hmi-apim" -> "privatelaw"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-hmiapimithc.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftithc.uksouth.cloudapp.azure.com"
              ~ host_header = "hmi-apim.ithc.platform.hmcts.net" -> "privatelaw.ithc.platform.hmcts.net"
                # (5 unchanged attrib

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

direct"
          ~ name               = "fact-adminHttpsRedirect" -> "cmc-legalHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "rpts",
              + "fact",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/rptsHttpsRedirect"
          ~ name               = "rptsHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv",
              + "fact-admin",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdivHttpsRedirect"
          ~ name               = "nfdivHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-apply",
              + "rpts",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdiv-applyHttpsRedirect"
          ~ name               = "nfdiv-applyHttpsRedirect" -> "rptsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-civil",
              + "nfdiv",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/nfdiv-civilHttpsRedirect"
          ~ name               = "nfdiv-civilHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "gateway-ccd",
              + "nfdiv-apply",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/gateway-ccdHttpsRedirect"
          ~ name               = "gateway-ccdHttpsRedirect" -> "nfdiv-applyHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "return-case-doc-ccd",
              + "nfdiv-civil",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/return-case-doc-ccdHttpsRedirect"
          ~ name               = "return-case-doc-ccdHttpsRedirect" -> "nfdiv-civilHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-approve-org",
              + "gateway-ccd",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-approve-orgHttpsRedirect"
          ~ name               = "xui-approve-orgHttpsRedirect" -> "gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-manage-org",
              + "return-case-doc-ccd",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-manage-orgHttpsRedirect"
          ~ name               = "xui-manage-orgHttpsRedirect" -> "return-case-doc-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-register-org",
              + "xui-approve-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-register-orgHttpsRedirect"
          ~ name               = "xui-register-orgHttpsRedirect" -> "xui-approve-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-webapp",
              + "xui-manage-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/xui-webappHttpsRedirect"
          ~ name               = "xui-webappHttpsRedirect" -> "xui-manage-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "xui-register-org",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "xui-register-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "xui-webapp",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "xui-webappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "ia-aip",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "probate",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "pcq",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "lau",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "paybubble",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "bar",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "fees-register",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-tribunals",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/sscs-tribunalsHttpsRedirect"
          ~ name               = "sscs-tribunalsHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-cor",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/sscs-corHttpsRedirect"
          ~ name               = "sscs-corHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "sscs-tribunals",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "sscs-tribunalsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "sscs-cor",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "sscs-corHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "adoption-web",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "privatelaw",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "paymentoutcome-web",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "paymentoutcome-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "plum",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "plumHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.ithc.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "et-sya",
            ]
          + name               = "et-syaHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.ithc.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (31 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hmcts-access"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/hmcts-access"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "hmctsaccessithc"
      + resource_group_name   = "lz-ithc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1357,"Program":"tfcmt","SHA1":"","Target":"ithc-global","Vars":{}} -->